I've realized that every change on a NSX-v edge gateway requires the edge to be replaced, even the description
```
Terraform will perform the following actions:

  # vcd_edgegateway.edge1 must be replaced
-/+ resource "vcd_edgegateway" "edge1" {
      ~ default_external_network_ip     = "10.23.96.115" -> (known after apply)
      ~ description                     = "edge gw created by terraform" -> "edge gw created/modified by terraform" # forces replacement
      ~ external_network_ips            = [
          - "10.23.96.115",
        ] -> (known after apply)
      ~ id                              = "urn:vcloud:gateway:158b72e9-9b35-47d2-ad02-63c45956d0cdc" -> (known after apply)
        name                            = "org-testcoll_3_edge_1"
      ~ use_default_route_for_dns_relay = false -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
```
while almost every change on edge gateway can be done with:
```
PUT https://selfdcvcloud-coll.nuvolaitaliana.it/network/edges/{id}
```